import '../models/question_model.dart';

class Items {
  // internet addiction Text
  static List internetAddictionScale = [1, 2, 3, 4, 5];

  static List<ItemModel> internetAddictionItems = [
    ItemModel(
      1,
      'আপনি কি আপনার প্রযোজনের চাইতে বেশি সময় অনলাইনে থাকেন?',
    ),
    ItemModel(
      2,
      'আপনি কি অনলাইনে থাকার জন্য দৈনন্দিন কাজকে অবহেলা করেন?',
    ),
    ItemModel(
      3,
      'আপনি কি অনলাইনে থাকার উত্তেজনাকে আপনার প্রিয়জনের নৈকট্যের চাইতে বেশি পছন্দ করেন?',
    ),
    ItemModel(
      4,
      'আপনি কি অনলাইনের মাধ্যমে নতুন নতুন সম্পর্ক তৈরি করেন ?',
    ),
    ItemModel(
      5,
      'আপনার প্রিয়জন কি আপনার দীর্ঘক্ষণ অনলাইনে থাকার বিষয়ে অভিযোগ করে থাকেন?',
    ),
    ItemModel(
      6,
      'অনলাইনে সময় ব্যয় করার জন্য কি আপনার লেখাপড়া ক্ষতিগ্রস্থ হয়?',
    ),
    ItemModel(
      7,
      'ইন্টারনেট ব্যবহারের কারণে আপনার কর্ম সম্পাদন ও উৎপাদনশীলতা কি বাধাগ্রস্থ হয় ?',
    ),
    ItemModel(8,
        'আপনি অনলাইনে কি করেন এই প্রশ্নের উত্তরে আপনি কি আত্মরক্ষামূলক পন্থা বা গোপনীয়তা অবলম্বন করেন ?'),
    ItemModel(9,
        'আপনি কি আপনার জীবনের বিরক্তিকর চিন্তাগুলোকে ইন্টারনেটের সুখকর চিন্তা দ্বারা প্রতিস্থাপন করেন ?'),
    ItemModel(10, 'আপনি পুনরায় অনলাইনে বসার জন্য কি অস্থিরতা প্রকাশ করেন ?'),
    ItemModel(11,
        'ইন্টারনেট ছাড়া জীবনকে কি আপনি একঘেঁয়ে ও নিরানন্দময় বলে মনে করেন ?'),
    ItemModel(12,
        'অনলাইনে থাকার সময় কারো হস্তক্ষেপ আপনার মাঝে কি বিরক্তি তৈরি করে ?'),
    ItemModel(13, 'গভীর রাতে অনলাইনে থাকার ফলে আপনি কি দেরিতে ঘুমোতে যান?'),
    ItemModel(14,
        'অফলাইন থাকাকালীন সময়ে আপনি কি নিজেকে অনলাইনে থাকার চিন্তায় নিমগ্ন বা বিভোড় রাখেন?'),
    ItemModel(15,
        'আপনি কি অনলাইনে থাকার সময়কাল কমিয়ে আনার চেষ্টা করেন এবং ব্যর্থ হন?'),
    ItemModel(
        16, 'আপনি কতক্ষণ যাবৎ অনলাইনে থাকেন তা কি গোপন রাখার চেষ্টা করেন ?'),
    ItemModel(17,
        'অন্যদের সাথে বাইরে যাওয়ার চাইতে অনলাইনে থাকাকে কি আপনি বেশি পছন্দ করেন?'),
    ItemModel(18,
        'অফলাইনে থাকার সময় কি আপনি হতাশ, অভিমানী অথবা বিচলিত থাকেন যা পুনরায় অনলাইন হওয়ার সাথে সাথে আর থাকে না ?'),
  ];

  // Dark Triad Dirty Dozen
  static List dartTriadScale = [1, 2, 3, 4, 5, 6, 7];

  static List<ItemModel> dartTriadItems = [
    ItemModel(
      1,
      'কার্যসিদ্ধির জন্য অন্যদের ব্যবহার করার প্রবণতা আমার আছে।',
    ),
    ItemModel(
      2,
      'কার্যসিদ্ধির জন্য আমি মিথ্যা বা প্রতারণার আশ্রয় নিয়েছি।',
    ),
    ItemModel(
      3,
      'কার্যসিদ্ধির জন্য আমি চাটুকারিতার আশ্রয় নিয়েছি।',
    ),
    ItemModel(
      4,
      'নিজের কাজ সম্পন্ন করতে অন্যদের কাজে। লাগানোর প্রবণতা আমার রয়েছে।',
    ),
    ItemModel(
      5,
      'আমার অনুশোচনাবোধ কম।',
    ),
    ItemModel(
      6,
      'আমি আমার কাজের নৈতিক ভিত্তি নিয়ে চিন্তা করি না।',
    ),
    ItemModel(
      7,
      'আমি নির্বিকার বা অনুভূতিহীন প্রকৃতির।',
    ),
    ItemModel(8, 'আমি কঠিন প্রকৃতির মানুষ।'),
    ItemModel(9, 'আমি চাই অন্যরা আমার প্রশংসা করুক।'),
    ItemModel(10, 'আমি চাই অন্যরা আমার দিকে মনোযোগ দিক। '),
    ItemModel(11, 'আমি প্রতিপত্তি ও মর্যাদা লাভ করতে চাই।'),
    ItemModel(12,
        'আমার মাঝে অন্যদের থেকে বিশেষ আনুকূল্য প্রত্যাশা করার প্রবণতা রয়েছে।'),
  ];

  // wellbeing
  static List wellbeingScale = [0, 1, 2, 3, 4, 5];
  static List<ItemModel> wellbeingItems = [
    ItemModel(
      1,
      'বিগত দুই সপ্তাহ ধরে আমি প্রফুল্ল ও আদন্দ অনুভব করেছি।',
    ),
    ItemModel(
      2,
      'বিগত দুই সপ্তাহ ধরে আমি শান্ত ও স্বস্থি অনুভব করছি।',
    ),
    ItemModel(
      3,
      'বিগত দুই সপ্তাহ ধরে আমি সক্রিয় এবং সবল ছিলাম।',
    ),
    ItemModel(
      4,
      'বিগত দুই সপ্তাহ ধরে আমি সতেজ এবং ফুরফুরে অনুভূতি নিয়ে ঘুম থেকে জেগেছি।',
    ),
    ItemModel(
      5,
      'বিগত দুই সপ্তাহ ধরে দৈনন্দিন জীবনে এমন বিষয়গুলো আমি পেয়েছি যেগুলো আমি আগ্রহ নিয়ে চেয়েছি।',
    ),
  ];

  // wellbeing
  static List socialAnxietyScale = [0, 1];
  static List<ItemModel> socialAnxietyItems = [
    ItemModel(
      1,
      'আমি অপরিচিত সামাজিক পরিবেশেও স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      2,
      'সামাজিকতা মানতে বাধ্য করে এমন অবস্থা আমি এড়িয়ে চলতে চেষ্টা করি।',
    ),
    ItemModel(
      3,
      'অপরিচিত লোকের মাঝেও আমি স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      4,
      'মানুষকে এড়িয়ে চলার পিছনে আমার কোন বিশেষ উদ্দেশ্য নেই ।',
    ),
    ItemModel(
      5,
      'আমি প্রায়ই সামাজিক অনুষ্ঠান সমূহকে বিশৃঙ্খল দেখি।',
    ),
    ItemModel(
      6,
      'আমি সাধারণত সামাজিক অনুষ্ঠানে স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      7,
      'আমি বিপরীত লিঙ্গের কারো সাথে কথোপকথনের সময় সাধারণত সহজ থাকি।',
    ),
    ItemModel(
      8,
      'আমি ভালোভাবে কাউকে না জানা পর্যন্ত তাদের সাথে কথোপকথন এড়িয়ে চলি।',
    ),
    ItemModel(
      9,
      'যদি কোন নতুন ব্যক্তির সাথে পরিচয়ের সুযোগ আসে তাহলে আমি প্রায়ই তা গ্রহণ করি।',
    ),
    ItemModel(
      10,
      'পুরুষ ও মহিলা উভয়ের উপস্থিতিতে কোন ঘরোয়া প্রীতি সম্মেলনে যোগদান করতে আমি ভীষণ ভাবে নার্ভাস বোধ করি।',
    ),
    ItemModel(
      11,
      'ভালোভাবে কাউকে না জেনে লোকজনের সাথে মিশতে আমি সাধারণত নার্ভাস হয়ে পড়ি।',
    ),
    ItemModel(
      12,
      'আমি সাধারণত অনেক লোকের সাথে থাকতে স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      13,
      'আমি প্রায়ই লোকজন থেকে দূরে থাকতে চাই।',
    ),
    ItemModel(
      14,
      'অপরিচিত কোন লোকজনের সাথে থাকতে আমি সাধারণত নার্ভাস হয়ে পড়।',
    ),
    ItemModel(
      15,
      'কারো সাথে প্রথম পরিচয়ে আমি স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      16,
      'কারো সাথে পরিচিত হওয়ার সময় আমি উত্তেজিত ও নার্ভাস হয়ে পড়ি।',
    ),
    ItemModel(
      17,
      'ঘর ভর্তি অপরিচিত লোকের মধ্যে আমি যে কোনভাবেই প্রবেশ করতে পারি।',
    ),
    ItemModel(
      18,
      'আমি নিজ ইচ্ছায় কোনো বড় সমাবেশে যোগদান করি না।',
    ),
    ItemModel(
      19,
      'বয়োজ্যেষ্ঠরা যখন আমার সাথে কথা বলতে চান তখন আমি আগ্রহ ভরে তাদের সাথে কথা বলি।',
    ),
    ItemModel(
      20,
      'আমি যখন একদল লোকের মাঝে থাকি তখন প্রায়ই আমার মনে হয় আমি যেন কিনারে দাঁড়িয়ে আছি।',
    ),
    ItemModel(
      21,
      'আমি লোকজন থেকে নিজেকে দূওে সরিয়ে রাখতে ভালোবাসি।',
    ),
    ItemModel(
      22,
      'কোন ঘরোয়া বা সামাজিক অনুষ্ঠানে লোকজনের সাথে কথা বলতে আমি সংকোচ বোধ করিনা।',
    ),
    ItemModel(
      23,
      'আমি বড় কোন সমাবেশে কদাচিৎ সহজ হতে পারি।',
    ),
    ItemModel(
      24,
      'সামাজিক কোন অনুষ্ঠান এড়াতে আমি প্রায়ই অজুহাত খুঁজি।',
    ),
    ItemModel(
      25,
      'লোকজনের সাথে পরস্পর পরিচয় করিয়ে দিতে আমি কখনও কখনও দায়িত্ব গ্রহণ করে থাকি।',
    ),
    ItemModel(
      26,
      'আনুষ্ঠানিক কোনে সামাজিক অনুষ্ঠান আমি এড়াতে চেষ্টা করি।',
    ),
    ItemModel(
      27,
      'আমি সাধারণত সব ধরণের সামাজিক অনুষ্ঠানে যাই।',
    ),
    ItemModel(
      28,
      'আমি সহজে অপরের সাথে মিলে আনন্দ উপভোগ করি।',
    ),
  ];
}
