import 'package:wellbeingclinic/models/scale_model.dart';

import '../models/item_model.dart';

class Items {
  // wellbeing
  static String wellbeingInstruction =
      'নিচে সুস্থতা সম্পর্কিত ৫ টি উক্তি দেয়া আছে যা গত দুই সপ্তাহ ধরে আপনার অনুভূতিগুলো কেমন ছিল তা বর্ণনা করে। প্রতিটি উক্তি আপনার ক্ষেত্রে কতটু্কু প্রযোজ্য তা চিহ্নিত করুন।';
  static List wellbeingScale = [
    ScaleModel(0, 'কোন সময় নয়'),
    ScaleModel(1, 'কিছু সময়'),
    ScaleModel(2, 'অর্ধেক সময়ের চেয়ে কম'),
    ScaleModel(3, 'অর্ধেক সময়ের চেয়ে বেশি'),
    ScaleModel(4, 'অধিকাংশ সময়'),
    ScaleModel(5, 'সব সময়'),
  ];
  static List<ItemModel> wellbeingItems = [
    ItemModel(
      1,
      'বিগত দুই সপ্তাহ ধরে আমি প্রফুল্ল ও আনন্দ অনুভব করেছি।',
    ),
    ItemModel(
      2,
      'বিগত দুই সপ্তাহ ধরে আমি শান্ত ও স্বস্তি অনুভব করছি।',
    ),
    ItemModel(
      3,
      'বিগত দুই সপ্তাহ ধরে আমি সক্রিয় এবং সবল ছিলাম।',
    ),
    ItemModel(
      4,
      'বিগত দুই সপ্তাহ ধরে আমি সতেজ এবং ফুরফুরে অনুভূতি নিয়ে ঘুম থেকে জেগেছি।',
    ),
    ItemModel(
      5,
      'বিগত দুই সপ্তাহ ধরে দৈনন্দিন জীবনে এমন বিষয়গুলো আমি পেয়েছি যেগুলো আমি আগ্রহ নিয়ে চেয়েছি।',
    ),
  ];

  // internet addiction Text
  static String internetAddictionInstruction =
      'নিম্নে বামপাশে আপনার ইন্টারনেট ব্যবহার সম্পর্কিত কিছু প্রশ্ন দেয়া আছে। প্রতিটি প্রশ্নের উত্তর ৫ বিন্দু বিশিষ্ট মানকের মাধ্যমে ডান পাশে দেয়া আছে। আপনি আপনার নিজের কথা চিন্তা করে প্রতিটি প্রশ্নের জন্য প্রযোজ্য উত্তরের সংখ্যাটি চিহ্নিত করুন। এখানে ভূল বা শুদ্ধ উত্তর বলে কিছু নেই। তাই অনুগ্রহ করে অকপটে উত্তর দিন।';
  static List internetAddictionScale = [
    ScaleModel(1, 'একেবারেই না'),
    ScaleModel(2, 'কিছুটা'),
    ScaleModel(3, 'মাঝে মাঝে'),
    ScaleModel(4, 'প্রায়ই'),
    ScaleModel(5, 'সব সময়'),
  ];
  static List<ItemModel> internetAddictionItems = [
    ItemModel(
      1,
      'আপনি কি আপনার প্রযোজনের চাইতে বেশি সময় অনলাইনে থাকেন?',
    ),
    ItemModel(
      2,
      'আপনি কি অনলাইনে থাকার জন্য দৈনন্দিন কাজকে অবহেলা করেন?',
    ),
    ItemModel(
      3,
      'আপনি কি অনলাইনে থাকার উত্তেজনাকে আপনার প্রিয়জনের নৈকট্যের চাইতে বেশি পছন্দ করেন?',
    ),
    ItemModel(
      4,
      'আপনি কি অনলাইনের মাধ্যমে নতুন নতুন সম্পর্ক তৈরি করেন ?',
    ),
    ItemModel(
      5,
      'আপনার প্রিয়জন কি আপনার দীর্ঘক্ষণ অনলাইনে থাকার বিষয়ে অভিযোগ করে থাকেন?',
    ),
    ItemModel(
      6,
      'অনলাইনে সময় ব্যয় করার জন্য কি আপনার লেখাপড়া ক্ষতিগ্রস্থ হয়?',
    ),
    ItemModel(
      7,
      'ইন্টারনেট ব্যবহারের কারণে আপনার কর্ম সম্পাদন ও উৎপাদনশীলতা কি বাধাগ্রস্থ হয় ?',
    ),
    ItemModel(8,
        'আপনি অনলাইনে কি করেন এই প্রশ্নের উত্তরে আপনি কি আত্মরক্ষামূলক পন্থা বা গোপনীয়তা অবলম্বন করেন ?'),
    ItemModel(9,
        'আপনি কি আপনার জীবনের বিরক্তিকর চিন্তাগুলোকে ইন্টারনেটের সুখকর চিন্তা দ্বারা প্রতিস্থাপন করেন ?'),
    ItemModel(10, 'আপনি পুনরায় অনলাইনে বসার জন্য কি অস্থিরতা প্রকাশ করেন ?'),
    ItemModel(11,
        'ইন্টারনেট ছাড়া জীবনকে কি আপনি একঘেঁয়ে ও নিরানন্দময় বলে মনে করেন ?'),
    ItemModel(12,
        'অনলাইনে থাকার সময় কারো হস্তক্ষেপ আপনার মাঝে কি বিরক্তি তৈরি করে ?'),
    ItemModel(13, 'গভীর রাতে অনলাইনে থাকার ফলে আপনি কি দেরিতে ঘুমোতে যান?'),
    ItemModel(14,
        'অফলাইন থাকাকালীন সময়ে আপনি কি নিজেকে অনলাইনে থাকার চিন্তায় নিমগ্ন বা বিভোর রাখেন?'),
    ItemModel(15,
        'আপনি কি অনলাইনে থাকার সময়কাল কমিয়ে আনার চেষ্টা করেন এবং ব্যর্থ হন?'),
    ItemModel(
        16, 'আপনি কতক্ষণ যাবৎ অনলাইনে থাকেন তা কি গোপন রাখার চেষ্টা করেন ?'),
    ItemModel(17,
        'অন্যদের সাথে বাইরে যাওয়ার চাইতে অনলাইনে থাকাকে কি আপনি বেশি পছন্দ করেন?'),
    ItemModel(18,
        'অফলাইনে থাকার সময় কি আপনি হতাশ, অভিমানী অথবা বিচলিত থাকেন যা পুনরায় অনলাইন হওয়ার সাথে সাথে আর থাকে না ?'),
  ];

  // Dark Triad Dirty Dozen
  static String dartTriadInstruction =
      'নিম্নে ব্যক্তিত্ব পরিমাপের কিছু উক্তি রয়েছে। প্রতিটি উক্তি আপনার ক্ষেত্রে কতুটুকু প্রযোজ্য তা ৭ মানকের যা কোন একটিতে টিকে প্রদানের মাধ্যমের প্রকাশ করুন।';
  static List dartTriadScale = [
    ScaleModel(1, 'দৃঢ় ভাবে অসম্মতি'),
    ScaleModel(2, 'অসম্মতি'),
    ScaleModel(3, 'সামান্য অসম্মতি'),
    ScaleModel(4, 'অসম্মতি বা সম্মতি কোনটি নয়'),
    ScaleModel(5, 'সামান্য সম্মতি'),
    ScaleModel(6, 'সম্মতি'),
    ScaleModel(7, 'দৃঢ় ভাবে সম্মতি'),
  ];
  static List<ItemModel> dartTriadItems = [
    ItemModel(
      1,
      'কার্যসিদ্ধির জন্য অন্যদের ব্যবহার করার প্রবণতা আমার আছে।',
    ),
    ItemModel(
      2,
      'কার্যসিদ্ধির জন্য আমি মিথ্যা বা প্রতারণার আশ্রয় নিয়েছি।',
    ),
    ItemModel(
      3,
      'কার্যসিদ্ধির জন্য আমি চাটুকারিতার আশ্রয় নিয়েছি।',
    ),
    ItemModel(
      4,
      'নিজের কাজ সম্পন্ন করতে অন্যদের কাজে লাগানোর প্রবণতা আমার রয়েছে।',
    ),
    ItemModel(
      5,
      'আমার অনুশোচনাবোধ কম।',
    ),
    ItemModel(
      6,
      'আমি আমার কাজের নৈতিক ভিত্তি নিয়ে চিন্তা করি না।',
    ),
    ItemModel(
      7,
      'আমি নির্বিকার বা অনুভূতিহীন প্রকৃতির।',
    ),
    ItemModel(8, 'আমি কঠিন প্রকৃতির মানুষ।'),
    ItemModel(9, 'আমি চাই অন্যরা আমার প্রশংসা করুক।'),
    ItemModel(10, 'আমি চাই অন্যরা আমার দিকে মনোযোগ দিক। '),
    ItemModel(11, 'আমি প্রতিপত্তি ও মর্যাদা লাভ করতে চাই।'),
    ItemModel(12,
        'আমার মাঝে অন্যদের থেকে বিশেষ আনুকূল্য প্রত্যাশা করার প্রবণতা রয়েছে।'),
  ];

  // selfEsteem
  static String selfEsteemInstruction =
      'নিচে আত্মমর্যাদা সম্পর্কিত ১০টি উক্তি রয়েছে। প্রতিটি উক্তি আপনার ক্ষেত্রে কতটুকু প্রযোজ্য তা ৪টি পছন্দক্রমের যেকোনো একটিতে টিক(v) চিহ্ন দিয়ে প্রকাশ করুন।';

  static List selfEsteemScaleP = [
    ScaleModel(3, 'সম্পূর্ণভাবে একমত'),
    ScaleModel(2, 'একমত'),
    ScaleModel(1, 'একমত নই'),
    ScaleModel(0, 'একেবারেই একমত নই'),
  ];
  static List selfEsteemScaleN = [
    ScaleModel(0, 'সম্পূর্ণভাবে একমত'),
    ScaleModel(1, 'একমত'),
    ScaleModel(2, 'একমত নই'),
    ScaleModel(3, 'একেবারেই একমত নই'),
  ];

  static List<ItemModel> selfEsteemItems = [
    ItemModel(
      1,
      'অন্যদের সাথে সমান মাপকাঠিতে বিচার করলে আমি মনে করি আমি একজন যোগ্য ব্যক্তি।',
    ),
    ItemModel(
      2,
      'আমি মনে করি আমার বেশ কিছু ভাল গুণ আছে।',
    ),
    ItemModel(
      3,
      'সামগ্রিক বিচারে আমার মনে করার প্রবণতা আছে যে আমি ব্যর্থ।',
    ),
    ItemModel(
      4,
      'বেশিরভাগ লোকের মতো আমিও বিভিন্ন কাজ করতে সক্ষম।',
    ),
    ItemModel(
      5,
      'আমার মনে হয় গর্ব করার মত আমার বেশি কিছু নেই।',
    ),
    ItemModel(
      6,
      'নিজের প্রতি আমার ইতিবাচক মনোভাব আছে।',
    ),
    ItemModel(
      7,
      'আমি নিজেকে নিয়ে মোটামুটি সন্তুষ্ট।',
    ),
    ItemModel(
      8,
      'আমার ইচ্ছে হয় আমি নিজের প্রতি আরও শ্রদ্ধাশীল হবো।',
    ),
    ItemModel(
      9,
      'মাঝে মাঝে আমার মনে হয় আমার মূল্য নেই।',
    ),
    ItemModel(
      10,
      'মাঝে মাঝে আমার মনে হয় আমি মোটেও ভালো নেই।',
    ),
  ];

  // socialAnxiety
  static String socialAnxietyInstruction =
      'নিচের বক্তব্য গুলো সামাজিক আচরণ বিষয়ক। আপনার ক্ষেত্রে মিল বা অমিলের ভিত্তিতে সত্য/মিথ্যা চিহ্নিত করুন।';
  static List socialAnxietyScale = [
    ScaleModel(
      0,
      'সত্য',
    ),
    ScaleModel(
      1,
      'মিথ্যা',
    ),
  ];
  static List<ItemModel> socialAnxietyItems = [
    ItemModel(
      1,
      'আমি অপরিচিত সামাজিক পরিবেশেও স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      2,
      'সামাজিকতা মানতে বাধ্য করে এমন অবস্থা আমি এড়িয়ে চলতে চেষ্টা করি।',
    ),
    ItemModel(
      3,
      'অপরিচিত লোকের মাঝেও আমি স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      4,
      'মানুষকে এড়িয়ে চলার পিছনে আমার কোন বিশেষ উদ্দেশ্য নেই ।',
    ),
    ItemModel(
      5,
      'আমি প্রায়ই সামাজিক অনুষ্ঠান সমূহকে বিশৃঙ্খল দেখি।',
    ),
    ItemModel(
      6,
      'আমি সাধারণত সামাজিক অনুষ্ঠানে স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      7,
      'আমি বিপরীত লিঙ্গের কারো সাথে কথোপকথনের সময় সাধারণত সহজ থাকি।',
    ),
    ItemModel(
      8,
      'আমি ভালোভাবে কাউকে না জানা পর্যন্ত তাদের সাথে কথোপকথন এড়িয়ে চলি।',
    ),
    ItemModel(
      9,
      'যদি কোন নতুন ব্যক্তির সাথে পরিচয়ের সুযোগ আসে তাহলে আমি প্রায়ই তা গ্রহণ করি।',
    ),
    ItemModel(
      10,
      'পুরুষ ও মহিলা উভয়ের উপস্থিতিতে কোন ঘরোয়া প্রীতি সম্মেলনে যোগদান করতে আমি ভীষণ ভাবে নার্ভাস বোধ করি।',
    ),
    ItemModel(
      11,
      'ভালোভাবে কাউকে না জেনে লোকজনের সাথে মিশতে আমি সাধারণত নার্ভাস হয়ে পড়ি।',
    ),
    ItemModel(
      12,
      'আমি সাধারণত অনেক লোকের সাথে থাকতে স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      13,
      'আমি প্রায়ই লোকজন থেকে দূরে থাকতে চাই।',
    ),
    ItemModel(
      14,
      'অপরিচিত কোন লোকজনের সাথে থাকতে আমি সাধারণত নার্ভাস হয়ে পড়।',
    ),
    ItemModel(
      15,
      'কারো সাথে প্রথম পরিচয়ে আমি স্বচ্ছন্দ বোধ করি।',
    ),
    ItemModel(
      16,
      'কারো সাথে পরিচিত হওয়ার সময় আমি উত্তেজিত ও নার্ভাস হয়ে পড়ি।',
    ),
    ItemModel(
      17,
      'ঘর ভর্তি অপরিচিত লোকের মধ্যে আমি যে কোনভাবেই প্রবেশ করতে পারি।',
    ),
    ItemModel(
      18,
      'আমি নিজ ইচ্ছায় কোনো বড় সমাবেশে যোগদান করি না।',
    ),
    ItemModel(
      19,
      'বয়োজ্যেষ্ঠরা যখন আমার সাথে কথা বলতে চান তখন আমি আগ্রহ ভরে তাদের সাথে কথা বলি।',
    ),
    ItemModel(
      20,
      'আমি যখন একদল লোকের মাঝে থাকি তখন প্রায়ই আমার মনে হয় আমি যেন কিনারে দাঁড়িয়ে আছি।',
    ),
    ItemModel(
      21,
      'আমি লোকজন থেকে নিজেকে দূরেও সরিয়ে রাখতে ভালোবাসি।',
    ),
    ItemModel(
      22,
      'কোন ঘরোয়া বা সামাজিক অনুষ্ঠানে লোকজনের সাথে কথা বলতে আমি সংকোচ বোধ করিনা।',
    ),
    ItemModel(
      23,
      'আমি বড় কোন সমাবেশে কদাচিৎ সহজ হতে পারি।',
    ),
    ItemModel(
      24,
      'সামাজিক কোন অনুষ্ঠান এড়াতে আমি প্রায়ই অজুহাত খুঁজি।',
    ),
    ItemModel(
      25,
      'লোকজনের সাথে পরস্পর পরিচয় করিয়ে দিতে আমি কখনও কখনও দায়িত্ব গ্রহণ করে থাকি।',
    ),
    ItemModel(
      26,
      'আনুষ্ঠানিক কোনে সামাজিক অনুষ্ঠান আমি এড়াতে চেষ্টা করি।',
    ),
    ItemModel(
      27,
      'আমি সাধারণত সব ধরণের সামাজিক অনুষ্ঠানে যাই।',
    ),
    ItemModel(
      28,
      'আমি সহজে অপরের সাথে মিলে আনন্দ উপভোগ করি।',
    ),
  ];

  // stress
  static String stressInstruction =
      'গত মাসে আপনার অনূভুতিও চিন্তা সম্পর্কিত কিছু প্রশ্ন করব। প্রতিটি প্রশ্ন আমি আপনাকে পড়ে শোনাব। প্রতিটি প্রশ্নের জন্য পাঁচটি (৫টি) করে জবাব দেয়া আছে। যেটি আপনার কাছে প্রযোজ্য মনে হবে সেভাবে জবাব দিন। এখানে ভূল বা সঠিক জবাব নেই আপনার নিজস্ব অনুভূতিই ব্যক্ত করুন। আপনার মতামত এভাবে প্রকাশ করুন।';
  static List stressScaleP = [
    ScaleModel(0, 'কখনই না'),
    ScaleModel(1, 'প্রায় কখনই না/বেশির ভাগ সময় না'),
    ScaleModel(2, 'মাঝে মাঝে'),
    ScaleModel(3, 'প্রায়ই/বেশিরভাগ সময়'),
    ScaleModel(4, 'খুব বেশি'),
  ];
  static List stressScaleN = [
    ScaleModel(
      4,
      'কখনই না',
    ),
    ScaleModel(
      3,
      'প্রায় কখনই না/বেশির ভাগ সময় না',
    ),
    ScaleModel(
      2,
      'মাঝে মাঝে',
    ),
    ScaleModel(
      1,
      'প্রায়ই/বেশিরভাগ সময়',
    ),
    ScaleModel(
      0,
      'খুব বেশি',
    ),
  ];
  static List<ItemModel> stressItems = [
    ItemModel(
      1,
      'গত কিছুদিন ধরে (মাসখানেক) কতটা মানসিক চাপের মধ্যে থেকেছেন?',
    ),
    ItemModel(
      2,
      'গত কিছুদিন একটুতেই কতটা ঘাবড়ে গেছেন বা নার্ভাস বোধ করেছেন?',
    ),
    ItemModel(
      3,
      'গত কিছুদিন ধরে আপনার জীবনের গুরুত্বপূর্ণ বিষয়গুলো নিয়ন্ত্রণ করতে আপনি কতটা ব্যর্থ হয়েছেন বলে আপনার মনে হয়?    ',
    ),
    ItemModel(
      4,
      'গত কিছুদিন ধরে পাড়াপড়শী, পরিবারের লোকজনের সাথে কতটা ঝগড়া বিবাদ লেগে থেকেছে?',
    ),
    ItemModel(
      5,
      'গত কিছুদিন ধরে আপনি কতটা অনিশ্চয়তার মধ্যে থেকেছেন ও বিচলিত বোধ করেছেন? ',
    ),
    ItemModel(
      6,
      'গত কিছুদিন ধরে কতটা এমন আকস্মিক কিছু ঘটনা ঘটেছে যাতে আপনি হতবাক হয়ে গিয়েছিলেন?',
    ),
    ItemModel(
      7,
      'গত কিছুদিন ধরে খুব মন দিয়ে  কাজ করে কাজটি শেষ করতে পেরেছেন বলে কতটা মনে করেন?',
    ),
    ItemModel(
      8,
      'গত কিছুদিন ধরে আপনার জীবনের পীড়নকর (কষ্টকর) ঘটনাগুলো প্রতিনিয়ত মনের মধ্যে কতটা ঘুরপাক খেয়েছে?',
    ),
    ItemModel(
      9,
      'গত কিছুদিন ধরে আপনার জীবনের বিরক্তিকর বিষয়গুলো কতটা নিয়ন্ত্রণ করতে পেরেছেন?',
    ),
    ItemModel(
      10,
      'গত কিছুদিন ধরে আপনার ব্যক্তিগত সমস্যা সামাল দেয়ার ব্যাপারে কতটা আত্নবিশ্বাসী ছিলেন?',
    ),
    ItemModel(
      11,
      'গত কিছুদিন ধরে আপনি কোনো সমস্যায় পড়লে তা মোকাবেলার জন্য কতটা আপ্রাণ চেষ্টা করেছেন?',
    ),
    ItemModel(
      12,
      'গত কিছুদিন ধরে আপনার সমস্যাগুলো  সহজ ভাবে মেনে নিতে চেষ্টা করেছেন কতটা?',
    ),
    ItemModel(
      13,
      'গত কিছুদিন ধরে কতটা বিমর্ষ (মনখারাপ) থেকেছেন?',
    ),
    ItemModel(
      14,
      'গত কিছুদিন ধরে কোনো কঠিন সমস্যায় পড়লে তা এড়িয়ে যেতে চেয়েছেন কতটা?',
    ),
    ItemModel(
      15,
      'গত কিছুদিন ধরে  অসুখ-বিসুখে (সর্দি, পেটের অসুখ প্রভৃতি) কতটা ভুগেছেন?',
    ),
    ItemModel(
      16,
      'গত কিছুদিন ধরে যা কিছু ঘটেছে তা আপনার নিয়ন্ত্রণের বাইরে ভেবে আপনি কতটা রাগান্বিত হয়েছেন?',
    ),
    ItemModel(
      17,
      'গত কিছুদিন ধরে পিঠে, ঘাড়ে, কোমরে ব্যাথায় (ক্রনিক) কতটা ভুগেছেন?',
    ),
    ItemModel(
      18,
      'গত কিছুদিন ধরে সবসময় মনে মনে একই চিন্তায় কতটা আচ্ছন্ন থেকেছেন?',
    ),
    ItemModel(
      19,
      'গত কিছুদিন ধরে সর্দি/ উচ্চরক্তচাপ/ডায়াবেটিস বেড়েছে কতটা?',
    ),
    ItemModel(
      20,
      'গত কিছুদিন ধরে কতটা দুর্বলতাবোধ করেছেন?',
    ),
  ];

  // das
  static String dasInstruction =
      'অনুগ্রহ করে নিচের প্রতিটি বিবৃতি পড়ুন এবং ০,১,২ অথবা ৩ এর মধ্যে কোন উক্তিটি আপনার ক্ষেত্রে প্রযোজ্য তা চিহ্নিত করুন। এখানে কোন সঠিক বা ভুল উত্তর নেই। কোন বিবৃতির জন্য বেশি সময় ব্যয় করবেন না।';

  static List dasScale = [
    ScaleModel(
      0,
      'আমার জন্য একেবারেই প্রযোজ্য নয়',
    ),
    ScaleModel(
      1,
      'আমার জন্য অল্পমাত্রায় বা কখনো কখনো প্রযোজ্য',
    ),
    ScaleModel(
      2,
      'আমার জন্য বেশ কিছু মাত্রায় বা বেশ খানিকটা সময়ের জন্য প্রযোজ্য',
    ),
    ScaleModel(
      3,
      'আমার জন্য খুব বেশি বা বেশি ভাগ সময়ের জন্য প্রযোজ্য',
    ),
  ];
  static List<ItemModel> dasItems = [
    ItemModel(
      1,
      'কোন উৎকণ্ঠা বা উত্তেজনামূলক কাজের পর আরামদায়ক অবস্থায় ফিরে আসা আমার জন্য কঠিন ছিল।',
    ),
    ItemModel(
      2,
      'আমি বুঝতে পারতাম যে আমার গলা শুকিয়ে আসছে।',
    ),
    ItemModel(
      3,
      'ইতিবাচক কোন অনুভূতিই আমার মধ্যে কাজ করত না।',
    ),
    ItemModel(
      4,
      'আমার শ্বাসকষ্টের অনুভূতি হত (যেমন অতিদ্রুত শ্বাসপ্রশ্বাস,শারীরিক পরিশ্রম ছাড়াই নিঃশ্বাস বন্ধ হয়ে আসা)',
    ),
    ItemModel(
      5,
      'নিজে উদ্যোগী হয়ে কোন কাজ শুরু করা আমার জন্য কঠিন হত।',
    ),
    ItemModel(
      6,
      'আমার মধ্যে বিভিন্ন পরিস্থিতিতে অতিরিক্ত প্রতিক্রিয়া করার প্রবণতা ছিল।',
    ),
    ItemModel(
      7,
      'আমার শরীর কাঁপার অভিজ্ঞতা হয়েছিল (যেমন হাত কাঁপা)।',
    ),
    ItemModel(
      8,
      'আমার মনে হতো যে আমি খুব বেশী স্নায়ু চাপে ভুগছি।',
    ),
    ItemModel(
      9,
      'আমি এমন পরিস্থিতি সম্পর্কে দুশ্চিন্তা গ্রস্ত ছিলাম যেখানে আমি তীব্রভাবে আতঙ্কিত হতে পারি এবং এমন কোন কাজ করতে পারি যাতে অন্যরা আমাকে বোকা মনে করবে।',
    ),
    ItemModel(
      10,
      'আমার মনে হচ্ছিল, ভবিষ্যতে আমার ভালো কিছুরই আশা নাই।',
    ),
    ItemModel(
      11,
      'আমি অনুভব করতাম যে আমি খুব অস্থির হয়ে যাচ্ছি।',
    ),
    ItemModel(
      12,
      'আরাম বোধ করা আমার জন্য কঠিন হত।',
    ),
    ItemModel(
      13,
      'আমি মনমরা এবং বিষণ্ণ অনুভব করতাম।',
    ),
    ItemModel(
      14,
      'আমার কাজে বাধা হয় এমন যে কোন জিনিসই আমার কাছে অসহ্য লাগত।',
    ),
    ItemModel(
      15,
      'আমার মনে হত এই বুঝি আমি হঠাৎ তীব্রভাবে আতঙ্কগ্রস্ত হচ্ছি।',
    ),
    ItemModel(
      16,
      'কোন কিছুতেই আমি বেশী আগ্রহী হতে পারতাম না।',
    ),
    ItemModel(
      17,
      'আমি অনুভব করতাম ব্যক্তি হিসেবে আমার বিশেষ কোন মূল্য নেই।',
    ),
    ItemModel(
      18,
      'আমি অনুভব করতাম আমি একটুতেই মনে ব্যাথা পাই।',
    ),
    ItemModel(
      19,
      'শারীরিক পরিশ্রম না করলেও আমি হৃদপিণ্ডের কাজ করা বুঝতে পারতাম (যেমনঃ হৃদপিণ্ডের স্পন্দন বৃদ্ধির অনুভূতি বা বুক ধড়ফড় করা, হৃদপিণ্ডের স্পন্দনে ব্যাঘাত)।',
    ),
    ItemModel(
      20,
      'যথাযথ কারণ ছাড়াই আমি ভীত সন্ত্রস্ত বোধ করতাম।',
    ),
    ItemModel(
      21,
      'জীবনটা অর্থহীন বলে মনে হত।',
    ),
  ];

  // hopelessness
  static String hopelessnessInstruction =
      'এই প্রশ্নপত্রে ২০টি উক্তি/বাক্য আছে। আপনি প্রতিটি বাক্য সতর্কতার সাথে পড়ুন। বাক্যগুলির যেটি আপনার মনের অবস্থাকে (আজকের দিন থেকে শুরু করে গত এক সপ্তাহে) সঠিক ভাবে তুলে ধরে তবে "সত্য" চিহ্নিত করুন। ঠিক একই ভাবে যে বাক্যটি আপনার মনের অবস্থার সাথে মিলছে না তবে "মিথ্যা" চিহ্নিত করুন। সবশেষে প্রতিটি বাক্য ঠিকমতো পড়া হয়েছে কি না তা দেখে নিন।';

  static List hopelessnessScale = [
    ScaleModel(1, 'সত্য'),
    ScaleModel(2, 'মিথ্যা'),
  ];

  static List<ItemModel> hopelessnessItems = [
    ItemModel(1, 'আমি আশা এবং উৎসাহ নিয়ে ভবিষ্যতের অপেক্ষায় আছি।'),
    ItemModel(2,
        'আমি সব আশা ছেড়ে দিয়েছি কারণ নিজের ভাল কোন কিছু করার জন্য আমার আর কিছুই করার নেই।'),
    ItemModel(3,
        'যখন খারাপ সময়ের ভিতর দিয়ে যাই, তখন আমি বুঝতে পারি যে সময় সবসময় খারাপ যাবে না।'),
    ItemModel(4, 'দশ বছর পর আমার জীবন কেমন হবে তা আমি কল্পনাও করতে পারি না।'),
    ItemModel(5,
        'আমি যেসব কাজ খুব বেশি করতে চাই, তা শেষ করার মত যথেষ্ট সময় আমার আছে।'),
    ItemModel(6,
        'যেসব বিষয়/কাজ নিয়ে আমি উদ্বিগ্ন থাকি আমি আশা করি যে ভবিষ্যতে আমি সেসব বিষয়ে সফল হব।'),
    ItemModel(7, 'আমার মনে হয় আমার ভবিষ্যত অন্ধকারাচ্ছন্ন।'),
    ItemModel(8,
        'আমি সাধারণভাবে একজন ভাগ্যবান এবং জীবনের ভাল জিনিসগুলোর অধিকাংশই একজন সাধারণ মানুষ অপেক্ষা বেশি পাওয়ার আশা করি।'),
    ItemModel(9,
        'আমি বিশ্রাম নেয়ার কোন সুযোগই পাইনা আর ভবিষ্যতে যে পাব তা বিশ্বাস করার মত কোন কারণও নেই।'),
    ItemModel(10,
        'অতীত অভিজ্ঞতা গুলো আমাকে ভবিষ্যতের জন্য সুন্দরভাবে তৈরী করে দিয়েছে।'),
    ItemModel(11, 'আমি আমার সামনে আনন্দের পরিবর্তে শুধু নিরানন্দ দেখি।'),
    ItemModel(12, 'যা আমি পেতে চাই তা পাওয়ার কোন আশা আমার নাই।'),
    ItemModel(
        13, 'আমি আশা করি ভবিষ্যতে আমি বর্তমান অবস্থার চেয়ে বেশি সুখে থাকবো।'),
    ItemModel(14, 'আমি যে ভাবে চাই, কোন কিছুই সেভাবে হয় না।'),
    ItemModel(15, 'ভবিষ্যত সম্পর্কে আমি বেশ আস্থাশীল।'),
    ItemModel(16, 'যা আমি চাই তা কখনোই পাই না, তাই নিজের জন্য চাওয়াটা বোকামী।'),
    ItemModel(17,
        'ভবিষ্যতে আমার প্রকৃতই সুখি/তৃপ্ত হবার (অর্থাৎ আমি প্রকৃতপক্ষে সন্তুষ্ট থাকব) সম্ভাবনা খুবই কম।'),
    ItemModel(18, 'ভবিষ্যত আমার কাছে অস্পষ্ট এবং অনিশ্চিত।'),
    ItemModel(19, 'আমি খারাপ সময়ের চাইতে ভাল সময়ের জন্য বেশী অপেক্ষা করবো।'),
    ItemModel(20,
        'কোন কিছু পাওয়ার জন্য চেষ্টা করার কোন মানে হয় না, কারণ সম্ভবতঃ সেটা পাওয়া যাবে না।'),
  ];

  // Depression
  static String depressionInstruction =
      'গত দুই সপ্তাহে আপনি কতবার নিচের সমস্যাগুলোর সম্মুখীন হয়েছেন? প্রতিটি বিবৃতি পড়ার পর চারটি সম্ভাব্য উত্তরের মধ্যে যেটি আপনার ক্ষেত্রে প্রযোজ্য সেটিতে ক্লিক করুন।';

  static List depressionScale = [
    ScaleModel(0, 'গত দুই সপ্তাহের কোনদিনই না'),
    ScaleModel(1, 'গত দুই সপ্তাহের কিছু কিছু দিন'),
    ScaleModel(2, 'গত দুই সপ্তাহের প্রায় অর্ধেকটা সময় জুড়ে'),
    ScaleModel(3, 'গত দুই সপ্তাহের প্রায় প্রতিদিন'),
  ];

  static List<ItemModel> depressionItems = [
    ItemModel(1, 'কোনোকিছু করার ব্যাপারে কম আগ্রহ বা আনন্দ।'),
    ItemModel(2, 'মনমরা, বিষণ্ণ, অথবা হতাশ বোধ করা।'),
    ItemModel(3, 'ঘুম আসতে বা ঘুমিয়ে থাকতে অসুবিধা, বা অতিরিক্ত ঘুম।'),
    ItemModel(4, 'ক্লান্ত বা শক্তিহীন অনুভব করা।'),
    ItemModel(5, 'ক্ষুধামন্দা বা অতিরিক্ত খাওয়া।'),
    ItemModel(6,
        'নিজের সম্পর্কে খারাপ বোধ করা- বা নিজেকে ব্যার্থ মনে করা কিংবা নিজেকে বা পরিবারকে ছোট করেছেন এমন মনে হওয়া।'),
    ItemModel(7,
        'কোনো কিছুতে মনোযোগ দিতে অসুবিধা, যেমন খবরের কাগজ পড়া বা টেলিভিশন দেখা।'),
    ItemModel(8,
        'খুব ধীরগতিতে চলাফেরা করা বা কথা বলা যা অন্যদের নজরে পড়ার মত কিংবা উল্টোটা- এত চঞ্চল বা অস্থির থাকা যে আপনি স্বাভাবিকের তুলনায় অনেক বেশি চলাফেরা করে বেড়াচ্ছেন।'),
    ItemModel(
        9, 'মরে যাওয়াই ভালো এমন চিন্তাধারা, বা কোনোভাবে নিজেকে আঘাত করা।'),
  ];

  // love obsession
  static String loveObsessionInstruction =
      'আপনি প্রেমে অবসেসড কিনা তা জানার জন্য নিম্নোক্ত প্রশ্নগুলোর ক্ষেত্রে “হ্যাঁ” বা “না” একটি উত্তর বেছে নিন।';

  static List loveObsessionScale = [
    ScaleModel(1, 'হ্যাঁ'),
    ScaleModel(0, 'না'),
  ];

  static List<ItemModel> loveObsessionItems = [
    ItemModel(1,
        'দৈহিক বা আবেগীয়ভাবে আপনার প্রেমিক/ প্রেমিকা কাছে নেই, কিন্তু তার জন্য আপনি কি সারাক্ষণ অস্থির থাকেন?'),
    ItemModel(2,
        'যদি আপনার প্রেমিক/ প্রেমিকা আপনার কাছে থাকে তবে কি সমস্ত দিন কেবল তার সঙ্গেই কাটাবেন?'),
    ItemModel(3,
        'আপনি কি বিশ্বাস করেন, যদি আপনি যথেষ্টভাবে তাকে চান তবে তিনিও আপনাকে ভালোবাসবেন?'),
    ItemModel(4,
        'আপনি কি বিশ্বাস করেন, যদি তাকে সঠিকভাবে রাজি করান যায় তবে তিনি আপনাকে গ্রহণ করবেন?'),
    ItemModel(5,
        'যখন আপনি ভালোবাসায় প্রত্যাখ্যাত হন, তখন কি কেবলই আপনার উত্তেজনা হিংসায় রূপ নেয়?'),
    ItemModel(6,
        'যখন আপনি বার বার প্রত্যাখ্যাত হন, তখন কি সে ব্যক্তির প্রতি আপনার সে ব্যক্তিকে আরো বেশি করে কাছে পেতে ইচ্ছা করে?'),
    ItemModel(7, 'তিনি ভালোবাসবেন না বলে নিজেকে পরিস্থিতির শিকার মনে হয়?'),
    ItemModel(8,
        'তার প্রতি তীব্র অনুভূতির কারণে আপনার খাওয়া, ঘুম, এবং কাজ-কর্মে ব্যাঘাত ঘটেছে?'),
    ItemModel(9,
        'আপনি কি বিশ্বাস করেন, তিনিই একমাত্র ব্যক্তি যিনি আপনার জীবনকে মূল্যবান করতে পারেন?'),
    ItemModel(10,
        'আপনি কি লক্ষ্য করেছেন, আপনি খুব বেশি পরিমাণে তাকে ডাকছেন অথবা প্রায়ই অসময়ে ডাকছেন কিংবা তার ফোনের জন্য দীর্ঘ সময় ধরে অপেক্ষা করছেন?'),
    ItemModel(11, 'আপনি কি তার বাড়ীতে যখন খুশি তখন না জানিয়েই হাজির হন?'),
    ItemModel(12,
        'আপনি কি সব সময় খোঁজ করেন, কোথায় আপনার ভালোবাসার ব্যক্তিটি থাকতে পারে? আপনি কি কখনো গোপনে তাকে অনুসরণ করেছেন?'),
    ItemModel(13, 'আপনি কি তার প্রতি বা আপনার প্রতি আক্রমণাত্মক কিছু করেছেন?'),
  ];

  // General Anxiety Disorder
  static String gadInstruction =
      'গত ২ সপ্তাহে কত ঘন ঘন আপনি নিম্নলিখিত সমস্যাগুলো অনুভব করেছেন?';

  static List gadScale = [
    ScaleModel(0, 'গত দুই সপ্তাহের কোনদিনই না'),
    ScaleModel(1, 'গত দুই সপ্তাহের কিছু কিছু দিন'),
    ScaleModel(2, 'গত দুই সপ্তাহের প্রায় অর্ধেকটা সময় জুড়ে'),
    ScaleModel(3, 'গত দুই সপ্তাহের প্রায় প্রতিদিন'),
  ];

  static List<ItemModel> gadItems = [
    ItemModel(1, 'নার্ভাস, উদ্বিগ্ন বা ভেঙ্গে পড়া অনুভব করেছি'),
    ItemModel(2, 'উদ্বেগকে থামাতে বা নিয়ন্ত্রণ করতে পারছি না'),
    ItemModel(3, 'বিভিন্ন বিষয় নিয়ে খুব বেশি চিন্তিত'),
    ItemModel(4, 'আরাম করতে পারছি না/ নির্ভার হতে পারছি না'),
    ItemModel(5, 'এতটা অস্থির যে চুপ করে বসে থাকা কষ্টকর'),
    ItemModel(6, 'সহজে বিরক্ত হচ্ছি'),
    ItemModel(7, 'ভয় লাগছে যেন ভয়ঙ্কর কিছু ঘটবে'),
  ];

  // Insomnia
  static String insomniaInstruction =
      'অনুগ্রহ করে, গত ২ সপ্তাহকে বিবেচনায় রেখে নিচের প্রশ্নগুলোর উত্তর দিন। প্রতিটি প্রশ্নের জন্য যে উত্তরটি আপনাকে সর্বোত্তমভাবে বর্ণনা করে এমন উত্তরটিতে ক্লিক করুন।';

  // 123
  static List insomniaScale123 = [
    ScaleModel(1, 'একেবারেই না'),
    ScaleModel(2, 'খুব সামান্য'),
    ScaleModel(3, 'মাঝে মাঝে'),
    ScaleModel(4, 'প্রায় সময়'),
    ScaleModel(5, 'সব সময়'),
  ];

  // 4
  static List insomniaScale4 = [
    ScaleModel(1, 'খুব সন্তুষ্ট'),
    ScaleModel(2, 'সন্তুষ্ট'),
    ScaleModel(3, 'মোটামুটি সন্তুষ্ট'),
    ScaleModel(4, 'অসন্তুষ্ট'),
    ScaleModel(5, 'খুব অসন্তুষ্ট'),
  ];

  // 5
  static List insomniaScale5 = [
    ScaleModel(1, 'একেবারেই লক্ষণীয় নয়'),
    ScaleModel(2, 'সামান্য'),
    ScaleModel(3, 'কিছুটা'),
    ScaleModel(4, 'অনেক'),
    ScaleModel(4, 'খুব বেশি লক্ষণীয়'),
  ];

  // 6
  static List insomniaScale6 = [
    ScaleModel(1, 'একেবারেই চিন্তিত নয়'),
    ScaleModel(2, 'সামান্য'),
    ScaleModel(3, 'কিছুটা'),
    ScaleModel(4, 'অনেক'),
    ScaleModel(4, 'খুব চিন্তিত'),
  ];

  // 7
  static List insomniaScale7 = [
    ScaleModel(1, 'একেবারেই প্রভাব ফেলছে না'),
    ScaleModel(2, 'সামান্য'),
    ScaleModel(3, 'কিছুটা'),
    ScaleModel(4, 'অনেক'),
    ScaleModel(4, 'অনেক বেশি প্রভাব ফেলছে'),
  ];

  //
  static List<ItemModel> insomniaItems = [
    ItemModel(1, 'ঠিক সময়ে ঘুমাতে সমস্যা হচ্ছে কিনা?'),
    ItemModel(2, 'বারবার ঘুম ভেঙ্গে যাচ্ছে কিনা?'),
    ItemModel(3, 'স্বাভাবিকের চেয়ে অল্প সময় ঘুমাচ্ছেন কিনা?'),
    ItemModel(4, 'আপনার ঘুমের বর্তমান অবস্থা নিয়ে আপনি কতটুকু সন্তুষ্ট?'),
    ItemModel(5,
        'আপনার ঘুমের সমস্যা যে জীবনকে একটু একটু করে পরিবর্তন করে ফেলছে তা অন্যদের কাছে কতটা লক্ষণীয় বলে মনে করেন?'),
    ItemModel(
        6, 'আপনার বর্তমান ঘুমের সমস্যা নিয়ে আপনি কতটা চিন্তিত বা উদ্বিগ্ন?'),
    ItemModel(7,
        'আপনার ঘুমের সমস্যা দিনের স্বাভাবিক কাজকর্মে, চিন্তাভাবনায়, বা স্মৃতিশক্তিতে কতখানি প্রভাব ফেলছে বলে মনে করেন?'),
  ];
}
